app/controllers/pins_controller.rb

INSERT INTO "pins" ("photo", "description", "created_at", "updated_at", "name") VALUES (?, ?, ?, ?, ?)
---
  def create
    @pin = Pin.new(pin_params)
    # @pin.user_id = current_user.id
    respond_to do |format|
      if @pin.save

UPDATE "pins" SET "photo" = ?, "name" = ?, "updated_at" = ? WHERE "pins"."id" = ?  [["photo", "http://www.comupedia.org/wp-content/uploads/2018/02/Nomi-Di-Cane.jpg"], ["name", ""], ["updated_at", "2018-06-15 23:00:05.726827"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @pin.update(pin_params)